In [110]:
import pandas as pd
import numpy as np

In [111]:
# bad way to multiple indexing:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pops = pd.Series(populations, index=index)
pops

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [112]:
pops[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [113]:
pops[[i for i in pops.index if i[1] == 2010]] #输出所有2010年数据

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [114]:
# The Better Way: Pandas MultiIndex
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [115]:
# re-index the series with MultiIndex
pops = pops.reindex(index)
pops

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [116]:
# 打印所有2010的数据
pops[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [117]:
# unstack()
pop_df = pops.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [118]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [119]:
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [120]:
pd.DataFrame(index)

                    0
0  (California, 2000)
1  (California, 2010)
2    (New York, 2000)
3    (New York, 2010)
4       (Texas, 2000)
5       (Texas, 2010)

In [121]:
pop2=pd.DataFrame({'total':populations},index) # 这里是双index
pop2

                    total
California 2000  33871648
           2010  37253956
New York   2000  18976457
           2010  19378102
Texas      2000  20851820
           2010  25145561

In [122]:
# add another column
pop_df = pd.DataFrame({'total': pops,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df  # 再加一列

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [123]:
f_u18 = pop_df['under18'] / pop_df['total'] #dataframe两列做运算，得到的结果是一个series
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [124]:
f_u18.unstack()  # Series可以被unstack成dataframe

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [125]:
# Methods of MultiIndex Creation
# passing arrays to create:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df # 双index

        data1     data2
a 1  0.536953  0.252802
  2  0.686251  0.794070
b 1  0.491081  0.144329
  2  0.176896  0.976966

In [126]:
# passing a dictionary to create
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [127]:
pd.Series(data).unstack()  #Series可以被unstack成dataframe

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [145]:
# MultiIndex 
# explicit MultiIndex constructor
index = [('主角', '男'), ('主角', '女'),('配角', '男'), ('配角', '女'),]
content = ['Will','Grace','Jack', 'Karen']
wag = pd.Series(content, index=index)
wag

(主角, 男)     Will
(主角, 女)    Grace
(配角, 男)     Jack
(配角, 女)    Karen
dtype: object

In [146]:
index_1 = pd.MultiIndex.from_arrays([['主角', '主角', '配角', '配角'], ['男','女','男','女']])
wag.reindex(index_1)

主角  男     Will
    女    Grace
配角  男     Jack
    女    Karen
dtype: object

In [147]:
index_2 = pd.MultiIndex.from_tuples([('主角','男'), ('主角','女'), ('配角','男'), ('配角','女')])
wag.reindex(index_2)

主角  男     Will
    女    Grace
配角  男     Jack
    女    Karen
dtype: object

In [148]:
index_3 = pd.MultiIndex.from_product([['主角','配角'], ['男','女']])
wag.reindex(index_3)

主角  男     Will
    女    Grace
配角  男     Jack
    女    Karen
dtype: object

In [149]:
index_4 = pd.MultiIndex(levels=[['主角','配角'], ['男','女']],
              labels=[[0, 0, 1, 1], [0, 1, 0, 1]])
wag.reindex(index_4)

主角  男     Will
    女    Grace
配角  男     Jack
    女    Karen
dtype: object

In [150]:
 # 用哪个index都一样

In [151]:
wag_double_index=wag.reindex(index_1)
wag_double_index

主角  男     Will
    女    Grace
配角  男     Jack
    女    Karen
dtype: object

In [152]:
# MultiIndex level names
wag_double_index.index.names = ['主配角', '性别']
wag_double_index

主配角  性别
主角   男      Will
     女     Grace
配角   男      Jack
     女     Karen
dtype: object

In [153]:
wag_double_index.unstack()

性别       女     男
主配角
主角   Grace  Will
配角   Karen  Jack

In [154]:
# index=index,columns=['total']
wag_df=pd.DataFrame(content,index) 
wag_df

             0
(主角, 男)   Will
(主角, 女)  Grace
(配角, 男)   Jack
(配角, 女)  Karen

In [155]:
# MultiIndex for columns

In [211]:
# Consider the example:
# which is a mock-up of some (somewhat realistic) medical data:

In [212]:
index = pd.MultiIndex.from_product([[2013,2014],['春','夏','秋','冬']],
                                   names=['年份','季度'])
index

columns = pd.MultiIndex.from_product([['英语','汉语','法语'],['听','说','读','写']],
                                      names=['学科','项目'])
columns

data = np.random.randint(90,120,size = [8,12])

data_df = pd.DataFrame(data, index = index, columns=columns)
data_df

学科        英语                  汉语                  法语
项目         听    说    读    写    听    说    读    写    听    说    读    写
年份   季度
2013 春   115  103   99  113   95   95  103  115  108  107  103  112
     夏    91   97   92   93  105  101   91  117   97   95   95  100
     秋   104  111  114  117  108  112  111  107   92   95  101  115
     冬   105  110  109  101   99  118  102  109  115  119  116  115
2014 春   101  108  113  103   99   99  114  117  100  106  114  108
     夏   106   99  119   95  107   97   97   90  103   91   98  116
     秋    93  112  118  100  107  104   91   91  113  113  111  115
     冬   105   99   92  108  108   99  114  105  101  106  104   91

In [213]:
data_df['英语']

项目         听    说    读    写
年份   季度
2013 春   115  103   99  113
     夏    91   97   92   93
     秋   104  111  114  117
     冬   105  110  109  101
2014 春   101  108  113  103
     夏   106   99  119   95
     秋    93  112  118  100
     冬   105   99   92  108

In [238]:
selected_columns = data_df['英语','听']  #先选列
selected_columns

年份    季度
2013  春     115
      夏      91
      秋     104
      冬     105
2014  春     101
      夏     106
      秋      93
      冬     105
Name: (英语, 听), dtype: int64

In [239]:
selected_columns[2013,'夏']  #再选行

91

In [215]:
data_df.iloc[::2,::4]

学科        英语   汉语   法语
项目         听    听    听
年份   季度
2013 春   115   95  108
     秋   104  108   92
2014 春   101   99  100
     秋    93  107  113

In [216]:
data

array([[115, 103,  99, 113,  95,  95, 103, 115, 108, 107, 103, 112],
       [ 91,  97,  92,  93, 105, 101,  91, 117,  97,  95,  95, 100],
       [104, 111, 114, 117, 108, 112, 111, 107,  92,  95, 101, 115],
       [105, 110, 109, 101,  99, 118, 102, 109, 115, 119, 116, 115],
       [101, 108, 113, 103,  99,  99, 114, 117, 100, 106, 114, 108],
       [106,  99, 119,  95, 107,  97,  97,  90, 103,  91,  98, 116],
       [ 93, 112, 118, 100, 107, 104,  91,  91, 113, 113, 111, 115],
       [105,  99,  92, 108, 108,  99, 114, 105, 101, 106, 104,  91]])

In [217]:
data[data>110]

array([115, 113, 115, 112, 117, 111, 114, 117, 112, 111, 115, 118, 115,
       119, 116, 115, 113, 114, 117, 114, 119, 116, 112, 118, 113, 113,
       111, 115, 114])

In [222]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
index
columns = pd.MultiIndex.from_product([['Bob', 'Julia', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])
columns
# mockup some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Julia         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      25.0  36.8  37.0  36.9  53.0  35.1
     2      21.0  35.5  41.0  36.0  43.0  37.7
2014 1      36.0  35.7  38.0  36.6  48.0  37.2
     2      45.0  38.4  18.0  36.8  52.0  37.4

In [223]:
health_data['Julia']

type          HR  Temp
year visit
2013 1      37.0  36.9
     2      41.0  36.0
2014 1      38.0  36.6
     2      18.0  36.8

In [224]:
pops

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [225]:
pops['California', 2000]

33871648

In [226]:
pops['California']

year
2000    33871648
2010    37253956
dtype: int64

In [227]:
# Partial Slicing
pops['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [228]:
pops[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [229]:
# selection based on Boolean masks:
pops[pops > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [230]:
# Selection based on fancy indexing also works:
pops[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [231]:
# Multiple indexed DataFrames
health_data

subject      Bob       Julia         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      25.0  36.8  37.0  36.9  53.0  35.1
     2      21.0  35.5  41.0  36.0  43.0  37.7
2014 1      36.0  35.7  38.0  36.6  48.0  37.2
     2      45.0  38.4  18.0  36.8  52.0  37.4

In [232]:
health_data['Julia', 'HR']

year  visit
2013  1        37.0
      2        41.0
2014  1        38.0
      2        18.0
Name: (Julia, HR), dtype: float64

In [233]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      25.0  36.8
     2      21.0  35.5

In [234]:
health_data.iloc[:3, :4]

subject      Bob       Julia
type          HR  Temp    HR  Temp
year visit
2013 1      25.0  36.8  37.0  36.9
     2      21.0  35.5  41.0  36.0
2014 1      36.0  35.7  38.0  36.6

In [235]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        25.0
      2        21.0
2014  1        36.0
      2        45.0
Name: (Bob, HR), dtype: float64

In [236]:
# errors
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (<ipython-input-236-000c5cdae2b3>, line 2)

In [237]:
#
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Julia   Sue
type          HR    HR    HR
year visit
2013 1      25.0  37.0  53.0
2014 1      36.0  38.0  48.0

In [ ]:
# Data Aggregations on Multi-Indices

In [44]:
# average-out the measurements in the two visits each year
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Julia          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     36.5  38.30  40.5  37.25  30.5  37.1
2014     28.5  35.65  29.5  37.85  38.5  36.5

In [45]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  35.833333  37.550000
2014  32.166667  36.666667